In [1]:
import numpy as np
import pandas as pd

In [2]:
dic1 = {
    'NAME':['PRECIOUS','NDIDI','GRACE', 'OLA'],
    'CORE':['DART','JAVASCRIPT','HTML',np.nan],
    'COMPANY':['GOOGLE','FACEBOOK','FASHION 24', 'NETFLIX'],
    'NET WORTH':['$1Million','$800,000','$500,000','$1Million']
}

In [3]:
dic2 = {
    'NAME':['PRECIOUS','NDIDI','GRACE', 'OLA'],
    'YEARS':[5,6,7,8],
    'PROJECTS HANDLED':[80,90,np.nan,120],
    'LIVES TOUCHED':['1Million','800,000','500,000','100,000']
}

In [4]:
dic3 = {
    'NAME':['PRECIOUS','NDIDI','GRACE', 'OLA'],
    'COUNTRY':['NIGERIA', 'GHANA', 'UNITED STATES', 'MALI'],
    'LANGUAGES':['ENGLISH', 'ENGLISH', 'ENGLISH', 'FRENCH'],
    'COUNTRIES VISITED':[40,np.nan,60,np.nan]
}
ind = ['']

In [5]:
A = pd.DataFrame(dic1)
B = pd.DataFrame(dic2)
C = pd.DataFrame(dic3)

In [6]:
B

       NAME  YEARS  PROJECTS HANDLED LIVES TOUCHED
0  PRECIOUS      5              80.0      1Million
1     NDIDI      6              90.0       800,000
2     GRACE      7               NaN       500,000
3       OLA      8             120.0       100,000

In [7]:
B.dropna()

       NAME  YEARS  PROJECTS HANDLED LIVES TOUCHED
0  PRECIOUS      5              80.0      1Million
1     NDIDI      6              90.0       800,000
3       OLA      8             120.0       100,000

In [8]:
B[['NAME']]

       NAME
0  PRECIOUS
1     NDIDI
2     GRACE
3       OLA

In [9]:
C.mean()

COUNTRIES VISITED    50.0
dtype: float64

In [10]:
arr1 = np.array([[2,4,5,6,1],[7,3,9,np.nan,3],[3,np.nan,4,np.nan,np.nan],[np.nan,3,2,1,7]])
arr2 = np.array(['A','B','C','D'])
arr3 = np.array(['U','V','W','X','Y'])

In [11]:
dtf = pd.DataFrame(data = arr1, index = arr2, columns = arr3)
dtf

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0
B  7.0  3.0  9.0  NaN  3.0
C  3.0  NaN  4.0  NaN  NaN
D  NaN  3.0  2.0  1.0  7.0

In [12]:
dtf.dropna(thresh=5)

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0

In [13]:
dtf['U'].count()

3

In [14]:
dtf.sort_values(by = 'U')

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0
C  3.0  NaN  4.0  NaN  NaN
B  7.0  3.0  9.0  NaN  3.0
D  NaN  3.0  2.0  1.0  7.0

In [15]:
DTF = dtf

In [16]:
DTF

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0
B  7.0  3.0  9.0  NaN  3.0
C  3.0  NaN  4.0  NaN  NaN
D  NaN  3.0  2.0  1.0  7.0

In [17]:
conc = pd.concat([A,B,C], axis = 1)

In [18]:
conc

,NAME,CORE,COMPANY,NET WORTH,NAME,YEARS,PROJECTS HANDLED,LIVES TOUCHED,NAME,COUNTRY,LANGUAGES,COUNTRIES VISITED
0,PRECIOUS,DART,GOOGLE,$1Million,PRECIOUS,5,80.0,1Million,PRECIOUS,NIGERIA,ENGLISH,40.0
1,NDIDI,JAVASCRIPT,FACEBOOK,"$800,000",NDIDI,6,90.0,"800,000",NDIDI,GHANA,ENGLISH,NaN
2,GRACE,HTML,FASHION 24,"$500,000",GRACE,7,NaN,"500,000",GRACE,UNITED STATES,ENGLISH,60.0
3,OLA,NaN,NETFLIX,$1Million,OLA,8,120.0,"100,000",OLA,MALI,FRENCH,NaN

In [19]:
B['YEARS'].unique()

array([5, 6, 7, 8], dtype=int64)